// чейнинг - фнкція долара поверне обєкт (наприкалад, по класу) з прописаними методами, які ми зможемо використати
// запускається метод з прототипу функції (кожен раз при виклику функції буде створюватись новий обєкт і запускатись метод, записаний в прототипі функції)
const $ = function(selector) {
    return new $.prototype.init(selector);
};
// отримує елементи
$.prototype.init = function(selector) {
    if (!selector) {
        return this; // {} порожній обєкт (поситання на новостворений обєкт)
    }
    // перевірка на передачу HTML вузол (тега, бо буде працювати лише при передачі класів)
    if (selector.tagName) {
        this[0] = selector;
        this.length = 1;
        return this;
    }
    // додає нові властивості, отримані з селектора, в новий обєкт, щоб вони закріпились в цьому обєкті
    Object.assign(this, document.querySelectorAll(selector));
    this.length = document.querySelectorAll(selector).length;
    return this; //зберігаються прототипи і елементи, з якими будемо взаємодіяти
};

// в прототип обєкта з ініт записуємо прототип головної функції (тепер на обєкті, що буде створюватись з допомогою функції доллара, ми можемо використовувати будь-які методи, які будуть всередині прототипа функції)
$.prototype.init.prototype = $.prototype;
// запис в глобальний обєкт віндов і отримуємо глобальну функцію
window.$ = $;

export default $;